logs/bench_concurrency_64_method_dflash.log
INFO 07-29 09:01:11 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-29 09:01:11 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-29 09:01:11 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 07-29 09:01:11 [__init__.py:238] Platform plugin ascend is activated
2026-07-29 09:02:19,671 - 1262926 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.20.2+empty: default 1
INFO 07-29 09:02:20 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-29 09:02:20 [nixl_utils.py:34] NIXL is not available
WARNING 07-29 09:02:20 [nixl_utils.py:44] NIXL agent config is not available
WARNING 07-29 09:02:20 [registry.py:945] Model architecture DeepseekV4ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4:AscendDeepseekV4ForCausalLM.
WARNING 07-29 09:02:20 [registry.py:945] Model architecture DeepSeekV4MTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4_mtp:DeepSeekV4MTP.
INFO 07-29 09:02:20 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 07-29 09:02:20 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffea26804a0>, trust_remote_code=True, seed=0, num_prompts=400, dataset_name='custom', no_stream=False, dataset_path='/workspace/gsm8k_jsonl/test_vllm.jsonl', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8061, endpoint='/v1/completions', header=None, max_concurrency=64, model='/home/trainee/models/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-db45509d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 400/400 [01:44<00:00,  3.85it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     400       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  104.00    
Total input tokens:                      27335     
Total generated tokens:                  102400    
Request throughput (req/s):              3.85      
Output token throughput (tok/s):         984.58    
Peak output token throughput (tok/s):    384.00    
Peak concurrent requests:                89.00     
Total token throughput (tok/s):          1247.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          590.88    
Median TTFT (ms):                        560.18    
P99 TTFT (ms):                           870.23    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.87     
Median TPOT (ms):                        60.16     
P99 TPOT (ms):                           75.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           182.84    
Median ITL (ms):                         183.33    
P99 ITL (ms):                            212.76    
---------------Speculative Decoding---------------
Acceptance rate (%):                     13.87     
Acceptance length:                       3.08      
Drafts:                                  33397     
Draft tokens:                            500955    
Accepted tokens:                         69472     
Per-position acceptance (%):
  Position 0:                            71.39     
  Position 1:                            46.30     
  Position 2:                            30.10     
  Position 3:                            20.23     
  Position 4:                            13.50     
  Position 5:                            9.18      
  Position 6:                            6.20      
  Position 7:                            4.03      
  Position 8:                            2.55      
  Position 9:                            1.66      
  Position 10:                           1.07      
  Position 11:                           0.73      
  Position 12:                           0.52      
  Position 13:                           0.35      
  Position 14:                           0.22      
==================================================
sys:1: DeprecationWarning: builtin type swigvarlink has no __module__ attribute